# -*- coding: UTF-8 -*-
''''
author: neo
Created on: 2019/1/10 16:12
Software: PyCharm Community Edition
'''
import pandas as pd
from pandas import DataFrame
import numpy

X = [[0.0888, 0.5885],
     [0.1399, 0.8291],
     [0.0747, 0.4974],
     [0.0983, 0.5772],
     [0.1276, 0.5703],
     [0.1671, 0.5835],
     [0.1906, 0.5276],
     [0.1061, 0.5523],
     [0.2446, 0.4007],
     [0.1670, 0.4770],
     [0.2485, 0.4313],
     [0.1227, 0.4909],
     [0.1240, 0.5668],
     [0.1461, 0.5113],
     [0.2315, 0.3788],
     [0.0494, 0.5590],
     [0.1107, 0.4799],
     [0.2521, 0.5735],
     [0.1007, 0.6318],
     [0.1067, 0.4326],
     [0.1956, 0.4280]
     ]
x = DataFrame(X)
# print(type(X),type(x))
# print(x.iloc[0:2])
# print(x.iloc[:2,[0,1]])
print(x.iloc[:,:]) #取所有行和列
print(x.iloc[:,[1]])# 取所有行，1列